run/ductShapeDesign/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// convertToMeters 0.001;

vertices
(
	(	0.00	-3.00	-0.1	)
	(	0.00	-0.15	-0.1	)
	(	0.00	0.00	-0.1	)
	(	0.00	3.00	-0.1	)
	(	0.38	3.00	-0.1	)
	(	3.00	3.00	-0.1	)
	(	3.00	0.00	-0.1	)
	(	3.00	-0.15	-0.1	)
	(	3.00	-3.00	-0.1	)
	(	0.36	-3.00	-0.1	)
	(	0.35	-3.00	-0.1	)
	(	0.35	-0.15	-0.1	)
	(	0.35	0.00	-0.1	)
	(	0.38	0.10	-0.1	)
	(	0.39	0.00	-0.1	)
	(	0.36	-0.15	-0.1	)
	(	0.00	-3.00	0.1	)
	(	0.00	-0.15	0.1	)
	(	0.00	0.00	0.1	)
	(	0.00	3.00	0.1	)
	(	0.38	3.00	0.1	)
	(	3.00	3.00	0.1	)
	(	3.00	0.00	0.1	)
	(	3.00	-0.15	0.1	)
	(	3.00	-3.00	0.1	)
	(	0.36	-3.00	0.1	)
	(	0.35	-3.00	0.1	)
	(	0.35	-0.15	0.1	)
	(	0.35	0.00	0.1	)
	(	0.38	0.10	0.1	)
	(	0.39	0.00	0.1	)
	(	0.36	-0.15	0.1	)
);

blocks
(
    hex (0 10 11 1 16 26 27 17) (10 30 1) simpleGrading (1 1 1)
    hex (1 11 12 2 17 27 28 18) (10 30 1) simpleGrading (1 1 1)
    hex (2 11 12 2 17 27 28 18) (10 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 22 23 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (16 17 39 38)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (3 25 31 9)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 6 28 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (22 28 29 23)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
